// =======================================================================
// Copyright (C) 2012-2020 长园继保自动化有限公司 All Rights Reserved
// 模块描述: VNCServer
// 模块版本: V1.00(初始化版本)
// 文件名     ：thread.c
// 创建人员: Administrator
// 创建时间: 2013-3-8
// =======================================================================
// 程序修改记录(最新的放在最前面):
// <V1.00> <2013-3-8>, <修改人员>: <修改功能概述>
// =======================================================================
//不同的平台对多线程的处理不一样

#include "stdint.h"
#include "stddef.h"

#include "os.h"
#include "VncOsPort.h"
//关于信号灯的使用
// =============================================================================
// 函数功能:创建一个线程(DJY中叫一个事件)
// 输入参数:
// 输出参数：
// 返回值     :
// =============================================================================
bool_t  TaskCreate(ptu32_t (*task)(void),void *arg,const char *name)
{
	bool_t result = false;
    u16 threadID;
    threadID = Djy_EvttRegist(EN_CORRELATIVE,CN_PRIO_RRS,0,0,
    						  task,NULL,0x400,name);
    if(threadID != CN_EVTT_ID_INVALID)
    {
    	if(CN_EVENT_ID_INVALID != Djy_EventPop(threadID,NULL,0,arg,0,0))
    	{
    		result = true;
    	}
    }
    return result;
}
// =============================================================================
// 函数功能:初始化一个信号量
// 输入参数:
// 输出参数：
// 返回值  :
// =============================================================================
tagMutexCB *MutexCreate(const char *name)
{
    return Lock_MutexCreate(name);
}
// =============================================================================
// 函数功能:删除一个信号量
// 输入参数:
// 输出参数：
// 返回值  :1 成功  0 失败
//          如果有正在等待的事件，对不起，删除失败，因为在djy中是不允许强制结束事件的
// =============================================================================
bool_t MutexDelete(tagMutexCB *mutex)
{
    return Lock_MutexDelete(mutex);
}
// =============================================================================
// 函数功能:等待一个信号量
// 输入参数:
// 输出参数：
// 返回值  :
//          会阻塞在此，直到有信号到来
// =============================================================================
bool_t MutexWait(tagMutexCB *mutex)
{
    return Lock_MutexPend(mutex,CN_TIMEOUT_FOREVER);
}
// =============================================================================
// 函数功能:发送一个信号
// 输入参数:
// 输出参数：
// 返回值  :
//          会阻塞在此，直到有信号到来
// =============================================================================
void MutexPost(tagMutexCB *mutex)
{
   Lock_MutexPost(mutex);
   return;
}
