/*
 * pwd.h
 *
 *  Created on: 2015年10月16日
 *      Author: zqf
 */

#ifndef PWD_H_
#define PWD_H_

#include <stdint.h>
#include <stdio.h>

#include <sys/types.h>

struct passwd
{
    char * pw_name; /* Username, POSIX.1 */
    char * pw_passwd; /* Password */
    __uid_t pw_uid; /* User ID, POSIX.1 */
    __gid_t pw_gid; /* Group ID, POSIX.1 */
    char * pw_gecos; /* Real Name or Comment field */
    char * pw_dir; /* Home directory, POSIX.1 */
    char * pw_shell; /* Shell Program, POSIX.1 */
};

//
//--------------------------------------------------------------------------------
//
//当您需要取得有关某个使用者的资讯时，大致上有以下几个函数可以使用：
//
//--------------------------------------------------------------------------------

struct passwd * getpwuid(uid_t uid);
//当您知道使用者的uid(user id)时，可以透过getpwuid来得知所有关於该使用者的相关资讯。



//--------------------------------------------------------------------------------

struct passwd * getpwnam(char * name);
//当您知道使用者名称时，可以透过getpwnam来得知所有关於该使用者的相关资讯。



//--------------------------------------------------------------------------------

int getpw(uid_t uid, char *buf);
//当您仅需要取得使用者的密码进行比对时，可以使用getpw。



//--------------------------------------------------------------------------------

//另外，有存取一系列使用者资讯的方法。


//--------------------------------------------------------------------------------

FILE * pwdopen(void);
//开启password档案。



//--------------------------------------------------------------------------------

struct passwd * pwdread(FILE * stream,struct passwd *p);
//读取一个使用者资讯进来，填到p中，返回p为成功，NULL为失败。



//--------------------------------------------------------------------------------

void setpwent(void);
//将读取资料流重设到起点。



//--------------------------------------------------------------------------------

void endpwent(void);
//关闭password档案资料流。



//--------------------------------------------------------------------------------

struct passwd * getpwent(void);
//读取一个使用者资讯进来，有必要的话，则将进行开档动作。



//--------------------------------------------------------------------------------

struct passwd * fgetpwent(FILE * stream);
//从档案中读取一个使用者资讯进来。



//--------------------------------------------------------------------------------

int putpwent(struct passwd *p,FILE *f);
//将一个使用者资讯写入档案中。



//--------------------------------------------------------------------------------

struct passwd * pwdalloc(void);
//配置一个记忆体区块给passwd用。

#endif /* PWD_H_ */
